examples/soap/zds1.1/Suites4SociaalDomein/dump/5 - edcLk01 621 Toevoegen Document Zaak.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">
   <s:Body>
      <StUF:Bv03Bericht xmlns:StUF="http://www.egem.nl/StUF/StUF0301">
         <StUF:stuurgegevens>
            <StUF:berichtcode>Bv03</StUF:berichtcode>
            <StUF:zender>
               <StUF:organisatie>1900</StUF:organisatie>
               <StUF:applicatie>CDR</StUF:applicatie>
            </StUF:zender>
            <StUF:ontvanger>
               <StUF:organisatie>1900</StUF:organisatie>
               <StUF:applicatie>GWS4all</StUF:applicatie>
               <StUF:gebruiker>Gebruiker</StUF:gebruiker>
            </StUF:ontvanger>
            <StUF:referentienummer>8055a774-2863-41ca-aa07-f65486781a3e</StUF:referentienummer>
            <StUF:tijdstipBericht>20200318123707649</StUF:tijdstipBericht>
            <StUF:crossRefnummer>c95a86d0-8584-4a6f-8309-0dd629d6af9b</StUF:crossRefnummer>
         </StUF:stuurgegevens>
      </StUF:Bv03Bericht>
   </s:Body>
</s:Envelope>