examples/soap/zds1.1/Suites4SociaalDomein/dump/2 - zakLk01 Generen Zaak.xml

<s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/">   <s:Body>      <StUF:Bv03Bericht xmlns:StUF="http://www.egem.nl/StUF/StUF0301">         <StUF:stuurgegevens>            <StUF:berichtcode>Bv03</StUF:berichtcode>            <StUF:zender>               <StUF:organisatie>1900</StUF:organisatie>               <StUF:applicatie>CDR</StUF:applicatie>            </StUF:zender>            <StUF:ontvanger>               <StUF:organisatie>1900</StUF:organisatie>               <StUF:applicatie>GWS4all</StUF:applicatie>               <StUF:gebruiker>Gebruiker</StUF:gebruiker>            </StUF:ontvanger>            <StUF:referentienummer>b8d096c5-3890-4979-872e-7eeb187f0bdf</StUF:referentienummer>            <StUF:tijdstipBericht>20200318123707415</StUF:tijdstipBericht>            <StUF:crossRefnummer>bcd36801-ba47-47ed-be4b-a245f335f6d9</StUF:crossRefnummer>         </StUF:stuurgegevens>      </StUF:Bv03Bericht>   </s:Body></s:Envelope>